main/Catalogs/Дети.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Дети</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКалендаря</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКалендаряПрививок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариПрививок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

main/Enums/ТипыКалендаряПрививок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипыКалендаряПрививок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НациональныйКалендарьУтвержденныйМинздравом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйКалендарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

main/Catalogs/Дети/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ТипКалендаря = Перечисления.ТипыКалендаряПрививок.НациональныйКалендарьУтвержденныйМинздравом;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура СформироватьКалендарьПрививок(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Или Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	СформироватьКалендарьПрививокНаСервере(Объект.Ссылка, Объект.ДатаРождения, Объект.Календарь);
	
	ТекстСообщения = НСтр("ru = 'Календарь сформирован'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	ОбновитьПовторноИспользуемыеЗначения();
	Оповестить("ОбновитьФормуНачальнойСтраницы");
	Оповестить("СформированаНациональныйКалендарь");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипКалендаряПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УправлениеФормой()
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьКалендарьПрививокНаСервере(РебенокСсылка, ДатаРождения, Календарь)
	
	РаботаСКалендаремСервер.СформироватьКалендарьПрививок(РебенокСсылка, ДатаРождения, Календарь);	
	
КонецПроцедуры

#КонецОбласти
